public class HomeWork {
    public static void main (String[] args) {
        printLiterals();
    }

    private static void printLiterals() {
        /*Вывести на консоль литералы следующих видов:
        целочисленный 2-й
        целочисленный 8-й
        целочисленный 10-й
        целочисленный 16-й
        */
    }

    //2) Необходимо написать программу, которая будет выводить на консоль таблицу приведения типов!
//              byte	short	char	int 	long	float	double	boolean
//    byte
//    short
//    char
//    int
//    long
//    float
//    double
//    boolean
//
//    На пересечении напишите следующие фразы:
//    ня (неявное) – если преобразование происходит автоматически,
//    я (явное) – если нужно использовать явное преобразование,
//    х – если преобразование невозможно,
//    т  - если преобразование тождественно.
//    Внимание! используйте System.out.printLn
}
